{"text":{"0":"Do you think he's trying to ask you out? Is it possible to let him and then turn him down? That might solve the issue.","1":"I also felt that most of the good guys I met irl are taken or not a match when I was looking in my late 20s and early 30s. Hence I'd to rely on the dating app. Got into 2 relationships from it, one of which is with my current partner. I recall having to actively search at that time. Sure, there were lots of frogs but still got there at the end.","2":"Yes no eye contact,OP. Please be safe. Start carrying pepper spray. And \"talk on the phone\" on your way to your apartment. \n\nThis dude is definitely dancing the line of stalking and he knows it.","3":"Have you identified what's \"not right\" and tried to talk to him about it? I don't think it's worth leaving a relationship that's been good enough for you to stay 7 whole years until you've figured out what the problem actually is and given both of you a chance to fix it.","4":"If youre still mulling this over, Id suggest watching Dan Savages Ted Talk, 3 Things We Get Wrong About Love. The part that applies to your situation here starts right around minute 6 (6:30ish). I found this talk a couple of years after a very painful divorce that I on some level initiated, and have regretted more than a little at different times in my life. I think if I had found it sooner it might have knocked some sense into me at the time.\n\nIt sounds like you have something really good and supportive in your life. I wouldnt be too quick to throw that away. Youll be fine either way, but please take your time and consider all sides first. \n\nhttps:\/\/m.youtube.com\/watch?v=brZIb4MG8oA","5":"A lot of people are recommending the invented boyfriend. But we need to consider that he swiped right on her on tinder. So he knows she has a profile on dating apps. That heavily implies that even if she states she has a boyfriend, she is still open to dating others. \n\nFamily in the army or police, like a brother or a dad, seems like a good hint to drop. Or, invent a NEW potential boyfriend. Go on the phone, talk to a friend about this date with a great guy that evening. Next time she runs into creepy McCreeperson, talk to the friend about how great the guy is, he is a police man like her dad, so masculine and she loves how buff he is. Next date lined up soon.\n\nPlay that game for two weeks or so, progressing the relationship every time he is in earshot, until it's plausible that she has a boyfriend and won't he dating anyone else either.","6":"Meaningless, shallow term.","7":"You don't need to change your voice or try to be a way that is different from who you are. In fact, lean the opposite way. Learn to love your voice, your features, your personality. You don't need to be attractive to all the men, you need to be attractive to the men who are interested in you. Learn to love yourself for who you are first, it will make the rest much easier.","8":"Yes, and I'd probably ask at some point. I know there can be a lot of reasons for it, I'd just want to make sure everything was ok.","9":"There are so many other reasons for what OP is talking about. Why would you immediately jump to that conclusion?","10":"Personally it wouldn't bother me, but then most of my friendships are ones where we mostly hang out and chat - there doesn't need to be an activity. I have one or two friends who are people who prefer to have an activity to do, in which case they are usually the ones to suggest things, because it's important to them. I wouldn't either of these positions are reflective of how much we value the friendship, so much as having different preferences for how to spend time together.\n\nWith friendship groups I think a person's role often reflects the place they have in that group. I've had friendship groups where I initiate meetups and organise things. And I have others where I don't do that because I'm not that central to the group - i.e. the others have mostly known each other longer and have stronger bonds. When I have organised things in those groups, people don't show much interest \/ don't show up. I have accepted that I'm not at the centre of that group, and that's okay. But I'll happily tag along when invited.","11":"This wouldnt bother me but I am not one to keep tabs on stuff like that and either are the friends that I have. Although its not important to me, I dont think you should stay in a friendship that is not what you want.","12":"Wow, what a generalizing, hate-filled post. Who upvotes this drivel?","13":"&gt;example: she brought canned food while I cooked a couple of dishes,\n\nWow, I definitely would not meet your expectations of \"friendship.\"\n\nSome people just don't operate that way. They just want to hang and don't have all these expectations.","14":"Sure, not everyone is or can be a planner. Who cares?","15":"Its harder, everyone is busier, has other commitments (like kids) and possibly the best options are already married. \n\nIn my early 20s, it was impossible to NOT meet new people. Now I rarely do unless intentionally.","16":"This is not a comment on you OP, but please dont take it personally that you are single at 29. There are a ton of people whod kill to be single and 29 again! Theres absolutely nothing wrong with it and if anything, Id consider you to be at the beginning of your dating pool\/search. Im 34 and just ended a serious relationship that I invested over two years in, back out there and there are plenty of guys interested in going out!","17":"I agree with the people who say he's probably just trying to run into you for a chance to chat you up. He is being more immature than someone should be at 40, but I still think that's the best explanation. At 31, a 40 year old isn't that much of an \"older guy\" for that to be predatory or creepy. You are now old enough to be eligible as a perfectly normal (sex or relationship) partner for a 40 year old man. I don't think this is at all strange or surprising, though I can understand it can be unpleasant if the attraction isn't mutual.","18":"I could have written this post as well as all your responses, right down to the details of not feeling the emotional connection and getting the support you need, and your partner being very passive and just going along with whatever you want to do. Im in the exact same position, and it is eating me up inside; the guilt and anxiety and fear for the future, the desire not to hurt him while knowing its hurting him more to stay... Every day I tell myself Im going to feel differently, but instead I just feel more suffocated and impatient and alone. Its like Im in one of those dreams where you know you need to move but you cant unstick your feet from the ground. \n\nUltimately, we both know what we need to do. I dont think youd be making this post if you didnt. Some people here are telling you that theres no-one else out there, and to stay with him when you arent in love because love is overrated etc. but to that Id say - is it better to be alone, and to be true to yourself, or to live a life of safety and convenience? To say good enough and be done, when the possibility of something truly amazing is out there? Do you believe youd be okay on your own? I relate to the financial worries, but could you get by? Do you enjoy your own company? Do you think youd grow and change in ways you never would without him? Or if you stayed - forever, and had those kids and that long safe marriage - at the end of your life, would you look back and be satisfied? \n\nWould you rather have a life lead by love or by fear?These are all the things Ive been asking myself. And if it makes you feel any better, in my social circles Im currently seeing a wave of long term relationships coming to their ends - couples in their early to late 30s and even early 40s realising that good enough wasnt enough to make them happy in the long run. It happens all the time, every day. Youre not alone.","19":"Don't bother. Just date the people whom you find attractive and interesting, and find you attractive and interesting in return. What's the point of ranking people like that?","20":"I do not subscribe to the idea of leagues either prescriptively or simply descriptively, but in general I feel like people date their socioeconomic peers. If I had to shoehorn an answer, I'd say your \"league\" is simply whom you can or do actually date.","21":"Thank you for sharing this ","22":"It doesnt need to be some huge confrontation though. Like if theres a time where they are both doing the awkward elevator dance again, OP could just say Ill take the stairs, bye. That communicates the message   Ive no interest in interacting with you further without having to have a big discussion about it.","23":"The Snowman","24":"Hey I just wanted to say that it seems like you are still holding a lot of guilt or ownership of this awkward dynamic that evolved with your neighbours and I think you should be a bit kinder to yourself. You shouldnt have to perform or present in a certain way so that you dont offend a self-appointed group of neighbourhood protectors \/ busy-bodies. I think its great that you have enough self-awareness and understanding of intersectionality to identify and analyse the problem, but you dont also need to own it. They were making a hell of a lot of assumptions about you too and it wasnt on you to act in ways that made you feel unsafe in order to protect their feelings. They hurt their own feelings \/ pride by making assumptions about the drivers of your behaviour and thats on them. Im glad things seem to be on a better footing now but you shouldnt feel like you need to pander to them or change how you behave in order to make yourself more acceptable to them. And this is coming from someone who has lived in areas with similar demographics to what you describe for 15+ years.","25":"Nope. I dont think Ill ever stop, as I like slathering myself in creams and smelling like a flower. I think Im more confident in my 30s though and Ive embraced more natural and comfort things over looking perfect. When in highschool I would get up and put on a full face of ugly makeup everyday and fry my hair straight. I look back and laugh, I dont know what I was thinking. I only wear a full face when going out for dinner or an event now. In general Ive been embracing my natural looks. When I do wear makeup my foundation is light so I can still see my freckles. I stopped colouring my hair in my mid 20s and have recently been trying to find heatless ways to tame it so its less damaged. Ive also stopped wearing wire bras because why be uncomfortable? I dont care that my boobs arent super perky.\nYou should try going out with less make up and help build up your confidence.","26":"Yes always be sure to be friendly to building security, cleaners, caretakers etc. I always make sure to get them each a card and some chocolates or booze at Christmas and that has paid dividends for me in so many situations over the years. Also when Ive done things that are against building rules (nothing outrageous, Im not a jerk, our property manager is just pretty highly strung) they always cover for me and let me know later like oh hey maybe you didnt know about this rule but dont worry weve got you. Also, they are all genuinely lovely people, I feel grateful to know them and they brighten my days in an otherwise pretty crappy apartment block lol.","27":"I'm a nurse that works in psych and I've had to use this grey rock move more times than I can count.  The secret is how to do it professionally without outwardly hurting anyone's feelings.\n\nIn real life I can do it not so nicely and I'm apparently just considered a bitch.  I'm okay with that though!!","28":"You should never ignore gut feelings HOWEVER\n\nI wanted to write from another perspective. I have a wonderful partner, perfect for me, excellent dad, truly an equal and I love him so so so so so much. \n\nWere there moments in there that I felt like I was missing out?  For sure!  I started dating him when I was 21 and didnt think it would be serious. He wasnt all of my checklist items. He actually was a bit of a wayward soul - but really who isnt at 21. \n\nAround 26\/27 I kinda started to panic. Shit was getting to the point where I had to define my life. This was it for me or it wasnt, ya know?  So I went to therapy to better understand myself. I have always been really comfortable alone. My husband who was boyfriend had started dating as long distance and still spent a lot of time doing our own things (we still do this and that is part of what I love about this relationship. I dont have to compromise my need to be alone sometimes).\n\nIs he perfect?  Nope. Does he do things that frustrate the hell out of me? Often. Do I do that to him?  Oh Im sure I do. \n\nThe important thing to me, what it all really boiled down to, was can I be myself, build a life I love, raise a family with him, see myself enjoying every stage of life with him.  The answer was yes. \n\nIt turned out, when I was looking down the lens of my life at 25\/26 - I was scared more due to some misplaced FOMO, like because we were still working stuff out personally that I could be missing something. But the real miss would have been never seeing him with my son. Or having his unconditional support to change careers and work overtime to succeed. Or see him flourish when he did the same. \n\nIm glad that I faced my misgivings through therapy and chose this path. I hope your time in therapy helps you pinpoint the not right feeling and helps you understand your choice. One thing I have landed on with certainty is THE MOST IMPORTANT choice you will make for your kids is who their father is. That is is thing you can never change later. Dig into that for sure if children are important and dont settle for the sunk cost fallacy if your bf would not be the most excellent partner. Times to have all the uncomfortable and weird talks about theoretical kids.  Like - what if they do drugs, are trans, have disabilities, you died and he was single father, etc etc etc","29":"Finance\n\n- Max out Roth IRA (if you can) - invest in total market index fund, I use FZROX (watch as many youtube vids on it until you understand it), literally time is money. You start investing in your age, yes even $300\/month could make you a millionaire by the time you retire.\n\n- max out your 401k (Roth) if you can when you start working.\n\n- if available to you, do HSA, max that out as well.\n\nMake sure you're starting to invest. Watch as many youtube videos as you can to fully understand these. I literally was watching \"investing with rose\" to set up my index funds.\n\nGood luck!","30":"As a guy, I know exactly how this man feels, being attracted to a woman and wanting to take things further. But I think he doesnt seem very good at paying attention, because I find it quite easy to spot when a woman isnt open to conversation etc. The signals are usually extremely obvious, plus I make damn sure nothing I do makes any women feel uncomfortable whether I want to strike up a relationship or not. On the other hand, she could treat him like just another neighbour (grey rock?! Never heard that phrase either). Its up to him to know the difference between not interested and lets chat. Not for her to take action. I reckon eventually he will get the message, just a shame it takes frickin ages for him to do so. Some guys are like that I guess.","31":"This.","32":"At 32 there is no reason you can't meet someone to have have family with. But I'd rather have children solo than have children with someone who wasn't my person. It's good to hear you have a therapist to talk this through with.","33":"[removed]","34":"Growing up my dad taught me these things and Im very grateful for that.","35":"Sounds like she doesnt feel confidentmaybe to her you seem a bit over-bearing and demanding and shes afraid not to meet your expectations? \n\nI agree with the other posters. I think youre being petty.","36":"Philadelphia. Limps in throat had happened with prior movies, but that was the first that evoked actual tears streaming down the face.","37":"Start experimenting to find out what makes you feel sexy. Admiring your body in the mirror? Lingerie or a cute outfit? A certain makeup look? Your humor? Your voice? Wearing heels or tennis shoes? Your intelligence? Dancing? Find out what turns it on for you and keep doing it, even if its in the comfort of your own home. I bet youll surprise yourself and find things that make you say damnnnn look at me go ","38":"This varies widely but from what I can recall, a studio package (e.g., all-inclusive) was something like $60K per year and a two-bed was close to $100K per year.","39":"I did this! I went to all the places we went, ate all the food he'd never eat, did activities he'd never do. It erases it being a \"him\" memory, now they're mine again. Really felt empowering and healing.","40":"Keep ignoring him. Earbuds and don't waste your time and energy on him.","41":"She's the one who clearly isn't interested, since she didn't ask him out. Her actions speak louder than words!","42":"Yes, from my experience, women will think something is wrong. A lot of them may internalize the lack of orgasm as something being wrong with themselves. They may think hes not physically attracted to them or that their sex is bad. When Im reality, it probably has nothing to do with the woman at all.","43":"Nothing specific to any of the things you mentioned, but I wish someone would have told me to do whatever makes me happy. \n\nI spent so much of my 20s trying to appease so many people (boyfriends, friends, jobs, etc.) and I wish someone would have bonked me on the head and said, hey, put yourself first and the rest will fall into place. I would have saved myself so much burnout, heartache, and time.\n\nFWIW I think youre doing great so far!","44":"Someone not being a planner doesn't bother me, nor does them being a bit... underwhelming, for lack of a better term, in the preparedness\/hospitality realm. Neither of these issues would strike me as a reason to end an otherwise enjoyable friendship, but that just means my pet peeves lie in a different field.","45":"Its pretty standard guy who thinks he may have a shot behavior. Rather than ignore him, Id suggest actively signaling your lack of interest.","46":"This is pretty normal unfortunately. I got mine in May and had heavy spotting through November, at which point I was experiencing skin discomfort from constantly wearing a pad. My OBGYN prescribed low dose birth control pills to take on top of the implant, no placebo week, and that has helped. I also have a friend whose equalized fully at the six month mark and she doesn't take anything so YMMV. There are options to treat the spotting, though-- low dose BC is common. The peace of mind of the implant is worth the fuss to me at this point.","47":"If it was a message they might regret or question they changed their mind about,  I would understand. But simple messages and multiple times? \n\nThey once asked a question, which I replied to and then they deleted the question. It wasnt a special question. They left the conversation before and my answerwhy? The conversation before was a more private matter. \n\nThe even funnier part, is this person has commented to others about  Theyll probably delete it.","48":"Firstly - do not second guess your gut instinct on this. Id also recommend the gift of fear for this. Im a very non confrontational person who 100% would gaslight myself in this scenario that Im being crazy and imagining some nice guy going about his day is a predator. The thing is - if youre wrong then worst case he feels either mortified himself (good learning experience) or deeply offended (in which case who cares) - if youre *right* then youre possibly in danger. Its not worth risking your safety to be polite.\n\nI have had 2 sort of comparable experiences and both times my gut was right that the guy was building to something (harmless but you never know) \n\n1. I worked at a cafe and this regular used to come in and be very chatty with the young girls working there, he was really pleasant and we imagined just lonely but it started to get a bit odd how much he would remember about our lives and some of us would see him around town in other places and he would wave and acknowledge us. It came to a head when he somehow added a few of us on Facebook. We told our manager and she had a word with him that it was inappropriate and making us feel uncomfortable. I dont know how he reacted but he stopped coming in very often which was a relief. A male colleague also vaguely knew him through family connections and I believe also had a word (possibly that made the difference too!) \n\n2. I was in the supermarket and this older guy comes up to me and asks me about a product I was looking at. I actually thought maybe he thought I worked there or something. We had a short chat and he left but I was like hmm thats weird (where Im from people dont really chat to strangers). Later in the same shop we bumped into each other again in another aisle and he chuckled that we were following each other, I nervously laughed. Again I thought, well thats plausible, people go round the shop in a pretty standard order. Again on the way out I saw him paying at the same time as me at another checkout and he waved at me. As I was leaving I needed to stop to get cash out (so I was delayed) and then I walked back to my car. When I got there out of nowhere he popped up right behind me and scared the shit out of me and goes this is weird to ask but do you have a boyfriend?. I said I did (which was true) and he goes ah damn all the best ones are taken and left. God knows why he thought that following me for an hour and stalking me to my car was a great pick up technique! \n\nAnyway my point is, my gut was right both times. If your gut says hes following you and building to something he probably is! \n\nYou have lots of advice on here. Sadly the best in my experience is to say\/make it clear youre with someone. You shouldnt have to go this to get a guy off your back but it is the only thing some understand. Do you have a male friend who you could take to the gym one time and be affectionate with? \n\nI also agree with telling someone in authority eg the security guard or building manager. Dont play it down and say things like Im sure Im being paranoid or whatever, just say youre feeling uncomfortable because this guy is following you around. \n\nAgree that documenting it in a text or email somehow with a friend or family member is good in case the very worst happened and he does actually do something. \n\nIf he tries to talk to you again dont be nice and chatty with him or even respond to his questions with short answers. Be a bit blunt and say something like I appreciate you being friendly but Im busy\/not interested in making friends in the building\/I have a boyfriend. Id like you to leave me alone please. \n\nGood luck with everything x","49":"\nWhat if the feeling you have now that \"something isn't right\" IS having a child with this man? You say he ticks all the boxes, you have a life together that people aim to have. Is there any possibility that your relationship is, in fact, the *right one*, and what's \"missing\" is a baby to make your family complete?"},"subreddit":{"0":"AskWomenOver30","1":"AskWomenOver30","2":"AskWomenOver30","3":"AskWomenOver30","4":"AskWomenOver30","5":"AskWomenOver30","6":"AskWomenOver30","7":"AskWomenOver30","8":"AskWomenOver30","9":"AskWomenOver30","10":"AskWomenOver30","11":"AskWomenOver30","12":"AskWomenOver30","13":"AskWomenOver30","14":"AskWomenOver30","15":"AskWomenOver30","16":"AskWomenOver30","17":"AskWomenOver30","18":"AskWomenOver30","19":"AskWomenOver30","20":"AskWomenOver30","21":"AskWomenOver30","22":"AskWomenOver30","23":"AskWomenOver30","24":"AskWomenOver30","25":"AskWomenOver30","26":"AskWomenOver30","27":"AskWomenOver30","28":"AskWomenOver30","29":"AskWomenOver30","30":"AskWomenOver30","31":"AskWomenOver30","32":"AskWomenOver30","33":"AskWomenOver30","34":"AskWomenOver30","35":"AskWomenOver30","36":"AskWomenOver30","37":"AskWomenOver30","38":"AskWomenOver30","39":"AskWomenOver30","40":"AskWomenOver30","41":"AskWomenOver30","42":"AskWomenOver30","43":"AskWomenOver30","44":"AskWomenOver30","45":"AskWomenOver30","46":"AskWomenOver30","47":"AskWomenOver30","48":"AskWomenOver30","49":"AskWomenOver30"}}